src/Enums/ПричиныПолученияБаллов/ПричиныПолученияБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныПолученияБаллов</name>
  <enumValues>
    <name>ЗаАренду</name>
  </enumValues>
  <enumValues>
    <name>ЗаИвент</name>
  </enumValues>
  <enumValues>
    <name>ПоРешениюСотрудника</name>
  </enumValues>
</mdclass:Enum>

src/Documents/УчастиеВИвенте/УчастиеВИвенте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчастиеВИвенте</name>
  <registerRecords>InformationRegister.УчастиеВИвентах</registerRecords>
  <registerRecords>AccumulationRegister.СтатистикаПользователей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ивент</name>
    <type>
      <types>CatalogRef.Ивенты</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПолучениеБонусныхБаллов/ПолучениеБонусныхБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПолучениеБонусныхБаллов</name>
  <registerRecords>AccumulationRegister.СтатистикаПользователей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныПолученияБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ивент</name>
    <type>
      <types>CatalogRef.Ивенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Document>

src/CommonForms/ЛКИвенты/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Клиент = ПользователиВызовСервера.ТекущийКлиент();

	Если Не ЗначениеЗаполнено(Клиент) Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Данная форма доступна только зарегистрированным клиентам.", , );
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ДоступныеИвенты.Параметры.УстановитьЗначениеПараметра("Клиент", Клиент);
	ВыполненныеИвенты.Параметры.УстановитьЗначениеПараметра("Клиент", Клиент);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИвент(Команда)
	Для Каждого Идентификатор Из Элементы.ДоступныеИвенты.ВыделенныеСтроки Цикл
		ВыполнитьОдин(Элементы.ДоступныеИвенты.ДанныеСтроки(Идентификатор).Ссылка);
	КонецЦикла;
	Элементы.ДоступныеИвенты.Обновить();
	Элементы.ВыполненныеИвенты.Обновить();
КонецПроцедуры

// Параметры:
//   Ивент - СправочникСсылка.Ивенты
&НаСервере
Процедура ВыполнитьОдин(Ивент)
	ТекДата = ТекущаяДатаСеанса();
	Попытка
		НачатьТранзакцию();
		Документ = Документы.УчастиеВИвенте.СоздатьДокумент();
		Документ.Клиент = Клиент;
		Документ.Ивент = Ивент;
		Документ.Дата = ТекДата;
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		Бонус = Ивент.Баллы;
		Документ = Документы.ПолучениеБонусныхБаллов.СоздатьДокумент();
		Документ.Дата = ТекДата;
		Документ.Клиент = Клиент;
		Документ.КоличествоБаллов = Бонус;
		Документ.Причина = Перечисления.ПричиныПолученияБаллов.ЗаИвент;
		Документ.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры
